/**
 * RegExp扩展
 * @author maodun
 */



// 整行匹配单引号和双引号
RegExp.quotes4total = /([\"\'])/g;
// 空字符
RegExp.emptyChar = /^\s+$/;
// 是否有空字符
RegExp.hasEmptyChar = /^(\S*\s+\S*)+$/;
// 数字，支持 '.12' 与 '12.' 格式的匹配
RegExp.num = /^(([-|+]{0,1}\d*\.{0,1}\d+)|([-|+]{0,1}\d+\.{0,1}\d*))$/;
// 是否有数字
RegExp.hasNum = /^(\D*\d+\D*)+$/;
// 整数
RegExp.intNum = /^[-|+]{0,1}\d+$/;
// 是否有整数
RegExp.hasIntNum = /^(\D*\d+\D*)+$/;
// 纯数字（无正负号）
RegExp.pureNum = /^\d+$/;
// 字母
RegExp.letter = /^[a-zA-Z]+$/;
// 是否有字母
RegExp.hasLetter = /^([^a-zA-Z]*[a-zA-Z]+[^a-zA-Z]*)+$/;
// 小写字母
RegExp.lowerLetter = /^[a-z]+$/;
// 是否有小写字母
RegExp.hasLowerLetter = /^([^a-z]*[a-z]+[^a-z]*)+$/;
// 大写字母
RegExp.upperLetter = /^[A-Z]+$/;
// 是否有大写字母
RegExp.hasUpperLetter = /^([^A-Z]*[A-Z]+[^A-Z]*)+$/;
// 中文，验证规则：1.只能是UniCode编码中的汉字范围[\u2E80-\u9FFF](注意：。《》、这四个中文符号以及中文空格也在其中)，2.长度为1位或以上
RegExp.chinese = /^((?!\s|。|《|》|、)[\u2E80-\u9FFF])+$/;
// 是否有中文，验证规则：1.至少有1个和多个UniCode编码中的汉字范围
RegExp.hasChinese = /^(([^\u2E80-\u9FFF]|\s|。|《|》|、)*((?!\s|。|《|》|、)[\u2E80-\u9FFF])+([^\u2E80-\u9FFF]|\s|。|《|》|、)*)+$/;
// 特殊字符，(包括空字符、全角字符与数字)
RegExp.spacialChar = /^([^\u2E80-\u9FFFa-zA-Z0-9]|\s|。|《|》|、)+$/;
// 是否有特殊字符，(包括空字符、全角字符与数字)
RegExp.hasSpacialChar = /^(((?!\s|。|《|》|、)[\u2E80-\u9FFFa-zA-Z0-9])*([^\u2E80-\u9FFFa-zA-Z0-9]|\s|。|《|》|、)+((?!\s|。|《|》|、)[\u2E80-\u9FFFa-zA-Z0-9])*)+$/;
// 半角特殊字符，未包含空格
RegExp.banJiaoSpacialChar = /^[\~\`\!\@\#\$\%\^\&\*\(\)\_\-\+\=\{\[\}\]\|\\\:\;\"\'\<\,\>\.\?\/]+$/;
// 是否有半角特殊字符，未包含空格
RegExp.hasBanJiaoSpacialChar = /^([^\~\`\!\@\#\$\%\^\&\*\(\)\_\-\+\=\{\[\}\]\|\\\:\;\"\'\<\,\>\.\?\/]*[\~\`\!\@\#\$\%\^\&\*\(\)\_\-\+\=\{\[\}\]\|\\\:\;\"\'\<\,\>\.\?\/]+[^\~\`\!\@\#\$\%\^\&\*\(\)\_\-\+\=\{\[\}\]\|\\\:\;\"\'\<\,\>\.\?\/]*)+$/;
// 全角特殊字符，未包含空格
RegExp.quanJiaoSpacialChar = /^[\～\｀\！\＠\＃\＄\％\＾\＆\＊\（\）\＿\－\＋\＝\｛\［\｝\］\｜\＼\：\；\＂\＇\＜\，\＞\．\？\／]+$/;
// 是否有全角特殊字符，未包含空格
RegExp.hasQuanJiaoSpacialChar = /^([^\～\｀\！\＠\＃\＄\％\＾\＆\＊\（\）\＿\－\＋\＝\｛\［\｝\］\｜\＼\：\；\＂\＇\＜\，\＞\．\？\／]*[\～\｀\！\＠\＃\＄\％\＾\＆\＊\（\）\＿\－\＋\＝\｛\［\｝\］\｜\＼\：\；\＂\＇\＜\，\＞\．\？\／]+[^\～\｀\！\＠\＃\＄\％\＾\＆\＊\（\）\＿\－\＋\＝\｛\［\｝\］\｜\＼\：\；\＂\＇\＜\，\＞\．\？\／]*)+$/;
// 手机号码，验证规则：1.前后不能有空字符，2.只能是数字，3.首字符为1，4.第二位字符为2~8之中的一个，5.长度为11位
RegExp.mobileNo = /^1[3-8]\d{9}$/;
// 短信验证码，验证规则：1.前后不能有空字符，2.只能是数字，3.长度为6位
RegExp.msgVCode = /^\d{6}$/;
// 邮政编码，验证规则：由6位数字组成
RegExp.postCode = /^\d{6}$/;
// URL
RegExp.url = /^https?:\/\/[A-z]\S*$/;
// 登录密码
RegExp.signinPwd = /^.{6,16}$/;